const button = document.querySelector('#btn');
const prediction = document.querySelector('.prediction-text');
const predictions = [
    " Все загаданные желания и намеченные планы осуществятся.",
    "Пришло время заявить о себе, даже если это кому-то не понравится.",
    "Сейчас в Вашей жизни наступает переломный момент, от которого зависит будущее.",
    "Пришло время показать, кем же Вы являетесь на самом деле.",
    "На протяжении многих лет Вам будут сопутствовать счастье, здоровье, удача и благополучие.",
    "Впереди Вас ждет неожиданное получение денег.",
    "Не огорчайтесь, если дела идут не так, как Вам бы этого хотелось, удача уже на пороге.",
    "Пора собирать чемоданы: Вас ждет путешествие в приятной компании.",
];

button.addEventListener('click', () => {
    prediction.textContent = predictions[Math.floor(Math.random() * predictions.length)];
    prediction.style.display = "block";
});